# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [14]:
# import libraries here
import pandas as pd
import math

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [3]:
# your code here

#### Print `temp`.

In [6]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [5]:
# your code here
employees = pd.read_csv('../data/employees.csv')

In [7]:
employees

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12000,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,NaN,205.0,110.0

#### Explore the data types of the `employees` dataframe. Comment your results.

In [12]:
# your code here
employees.astype

<bound method NDFrame.astype of      employ_id first_name last_name     email  phone_number   hire_date  \
0          100     Steven      King     SKING  515.123.4567  2003-06-17
1          101      Neena   Kochhar  NKOCHHAR  515.123.4568  2005-09-21
2          102        Lex   De Haan   LDEHAAN  515.123.4569  2001-01-13
3          103  Alexander    Hunold   AHUNOLD  590.423.4567  2006-01-03
4          104      Bruce     Ernst    BERNST  590.423.4568  2007-05-21
..         ...        ...       ...       ...           ...         ...
102        202        Pat       Fay      PFAY  603.123.6666  2005-08-17
103        203      Susan    Mavris   SMAVRIS  515.123.7777  2002-06-07
104        204    Hermann      Baer     HBAER  515.123.8888  2002-06-07
105        205    Shelley   Higgins  SHIGGINS  515.123.8080  2002-06-07
106        206    William     Gietz    WGIETZ  515.123.8181  2002-06-07

         job_id  salary  commission_pct  manager_id  department_id
0       AD_PRES   24000             NaN         NaN           90.0
1         AD_VP   17000             NaN       100.0           90.0
2         AD_VP   17000             NaN       100.0           90.0
3       IT_PROG    9000             NaN       102.0           60.0
4       IT_PROG    6000             NaN       103.0           60.0
..          ...     ...             ...         ...            ...
102      MK_REP    6000             NaN       201.0           20.0
103      HR_REP    6500             NaN       101.0           40.0
104      PR_REP   10000             NaN       101.0           70.0
105      AC_MGR   12000             NaN       101.0          110.0
106  AC_ACCOUNT    8300             NaN       205.0          110.0

[107 rows x 11 columns]>

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [15]:
# your code here
employees.salary.mean()

6461.682242990654

#### What's the highest salary?

In [16]:
# your code here
employees.salary.max()

24000

#### What's the lowest salary?

In [22]:
# your code here
min_salary = employees.salary.min()
min_salary

2100

#### Who are the employees with the lowest salary?

In [45]:
# your code here
#employees.loc[min_salary,"employ_id"]
employees[employees.salary == min_salary][["employ_id","first_name","last_name"]]

    employ_id first_name last_name
32        132         TJ     Olson

#### Find all the information about an employee called David.

In [35]:
# your code here
employees[employees.first_name == 'David']

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
5,105,David,Austin,DAUSTIN,590.423.4569,2005-06-25,IT_PROG,4800,NaN,103.0,60.0
51,151,David,Bernstein,DBERNSTE,011.44.1344.345268,2005-03-24,SA_REP,9500,0.25,145.0,80.0
65,165,David,Lee,DLEE,011.44.1346.529268,2008-02-23,SA_REP,6800,0.10,147.0,80.0

#### Could you return only David's salary?

In [36]:
# your code here
employees[employees.first_name == 'David']['salary']

5     4800
51    9500
65    6800
Name: salary, dtype: int64

#### Print all the rows where job title is associate.

In [ ]:
# your code here

In [38]:
departments = pd.read_csv('../data/departements.csv')
departments

    department_id       department_name  manager_id  location_id
0              10        Administration       200.0         1700
1              20             Marketing       201.0         1800
2              30            Purchasing       114.0         1700
3              40       Human Resources       203.0         2400
4              50              Shipping       121.0         1500
5              60                    IT       103.0         1400
6              70      Public Relations       204.0         2700
7              80                 Sales       145.0         2500
8              90             Executive       100.0         1700
9             100               Finance       108.0         1700
10            110            Accounting       205.0         1700
11            120              Treasury         NaN         1700
12            130         Corporate Tax         NaN         1700
13            140    Control And Credit         NaN         1700
14            150  Shareholder Services         NaN         1700
15            160              Benefits         NaN         1700
16            170         Manufacturing         NaN         1700
17            180          Construction         NaN         1700
18            190           Contracting         NaN         1700
19            200            Operations         NaN         1700
20            210            IT Support         NaN         1700
21            220                   NOC         NaN         1700
22            230           IT Helpdesk         NaN         1700
23            240      Government Sales         NaN         1700
24            250          Retail Sales         NaN         1700
25            260            Recruiting         NaN         1700
26            270               Payroll         NaN         1700

In [44]:
employees_departments = pd.merge(employees,departments, on='department_id')
employees_departments

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id_x,department_id,department_name,manager_id_y,location_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0,Executive,100.0,1700
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,2006-01-03,IT_PROG,9000,NaN,102.0,60.0,IT,103.0,1400
4,104,Bruce,Ernst,BERNST,590.423.4568,2007-05-21,IT_PROG,6000,NaN,103.0,60.0,IT,103.0,1400
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
101,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,NaN,201.0,20.0,Marketing,201.0,1800
102,203,Susan,Mavris,SMAVRIS,515.123.7777,2002-06-07,HR_REP,6500,NaN,101.0,40.0,Human Resources,203.0,2400
103,204,Hermann,Baer,HBAER,515.123.8888,2002-06-07,PR_REP,10000,NaN,101.0,70.0,Public Relations,204.0,2700
104,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12000,NaN,101.0,110.0,Accounting,205.0,1700
105,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,NaN,205.0,110.0,Accounting,205.0,1700

In [50]:
employees_departments[employees_departments.department_name == 'Executive']

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id_x,department_id,department_name,manager_id_y,location_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0,Executive,100.0,1700
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [49]:
# Method 1
# your code here
employees_departments.iloc[:3]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id_x,department_id,department_name,manager_id_y,location_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0,Executive,100.0,1700
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700

In [51]:
# Method 2
# your code here
employees_departments.head(3)

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id_x,department_id,department_name,manager_id_y,location_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0,Executive,100.0,1700
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700

#### Find the employees whose title is associate and whose salary is above 55.

In [55]:
# your code here
employees_departments[employees.salary >=10000]

<ipython-input-55-ccb3c1438096>:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  employees_departments[employees.salary >=10000]

,employ_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id_x,department_id,department_name,manager_id_y,location_id
0,100,Steven,King,SKING,515.123.4567,2003-06-17,AD_PRES,24000,NaN,NaN,90.0,Executive,100.0,1700
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,2005-09-21,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
2,102,Lex,De Haan,LDEHAAN,515.123.4569,2001-01-13,AD_VP,17000,NaN,100.0,90.0,Executive,100.0,1700
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,2002-08-17,FI_MGR,12000,NaN,101.0,100.0,Finance,108.0,1700
14,114,Den,Raphaely,DRAPHEAL,515.127.4561,2002-12-07,PU_MAN,11000,NaN,100.0,30.0,Purchasing,114.0,1700
45,180,Winston,Taylor,WTAYLOR,650.507.9876,2006-01-24,SH_CLERK,3200,NaN,120.0,50.0,Shipping,121.0,1500
46,181,Jean,Fleaur,JFLEAUR,650.507.9877,2006-02-23,SH_CLERK,3100,NaN,120.0,50.0,Shipping,121.0,1500
47,182,Martha,Sullivan,MSULLIVA,650.507.9878,2007-06-21,SH_CLERK,2500,NaN,120.0,50.0,Shipping,121.0,1500
48,183,Girard,Geoni,GGEONI,650.507.9879,2008-02-03,SH_CLERK,2800,NaN,120.0,50.0,Shipping,121.0,1500
49,184,Nandita,Sarchand,NSARCHAN,650.509.1876,2004-01-27,SH_CLERK,4200,NaN,121.0,50.0,Shipping,121.0,1500
50,185,Alexis,Bull,ABULL,650.509.2876,2005-02-20,SH_CLERK,4100,NaN,121.0,50.0,Shipping,121.0,1500
56,191,Randall,Perkins,RPERKINS,650.505.4876,2007-12-19,SH_CLERK,2500,NaN,122.0,50.0,Shipping,121.0,1500
62,197,Kevin,Feeney,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000,NaN,124.0,50.0,Shipping,121.0,1500
68,148,Gerald,Cambrault,GCAMBRAU,011.44.1344.619268,2007-10-15,SA_MAN,11000,0.3,100.0,80.0,Sales,145.0,2500
69,149,Eleni,Zlotkey,EZLOTKEY,011.44.1344.429018,2008-01-29,SA_MAN,10500,0.2,100.0,80.0,Sales,145.0,2500
74,154,Nanette,Cambrault,NCAMBRAU,011.44.1344.987668,2006-12-09,SA_REP,7500,0.2,145.0,80.0,Sales,145.0,2500
101,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000,NaN,201.0,20.0,Marketing,201.0,1800
104,205,Shelley,Higgins,SHIGGINS,515.123.8080,2002-06-07,AC_MGR,12000,NaN,101.0,110.0,Accounting,205.0,1700
105,206,William,Gietz,WGIETZ,515.123.8181,2002-06-07,AC_ACCOUNT,8300,NaN,205.0,110.0,Accounting,205.0,1700

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [58]:
# your code here
#date_min = employees_departments.hire_date.min()
#date_max = employees_departments.hire_date.max()

employees_departments['hire_year'] = [date[:4] for date in employees_departments.hire_date]
employees_departments[['hire_year','salary']].groupby('hire_year').mean()

                 salary
hire_year
2001       17000.000000
2002        9828.571429
2003        7750.000000
2004        8600.000000
2005        6824.137931
2006        5045.833333
2007        4883.333333
2008        5381.818182

####  What is the average salary per title?

In [62]:
# your code here
employees_departments[['department_name','salary']].groupby('department_name').mean()

                        salary
department_name
Accounting        10150.000000
Administration     4400.000000
Executive         19333.333333
Finance            8600.000000
Human Resources    6500.000000
IT                 5760.000000
Marketing          9500.000000
Public Relations  10000.000000
Purchasing         4150.000000
Sales              8955.882353
Shipping           3475.555556

####  Find the salary quartiles.

In [61]:
# your code here
employees_departments.salary.describe()

count      106.000000
mean      6456.603774
std       3927.583017
min       2100.000000
25%       3100.000000
50%       6150.000000
75%       8950.000000
max      24000.000000
Name: salary, dtype: float64

#### Is the mean salary different per gender?

In [63]:
# your code here
employees_departments[['department_name', 'salary']].groupby('department_name').mean()

                        salary
department_name
Accounting        10150.000000
Administration     4400.000000
Executive         19333.333333
Finance            8600.000000
Human Resources    6500.000000
IT                 5760.000000
Marketing          9500.000000
Public Relations  10000.000000
Purchasing         4150.000000
Sales              8955.882353
Shipping           3475.555556

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [65]:
# your code here
employees_departments_num = employees_departments.numeric
employees_departments_num.groupby(department_name).describe()

AttributeError: 'DataFrame' object has no attribute 'numeric'

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here